In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [17]:
df1=DataFrame(np.arange(12).reshape(3,4),
              index=['Uyo','Aba','Itu'],
             columns=list('ABCD'))
df1

     A  B   C   D
Uyo  0  1   2   3
Aba  4  5   6   7
Itu  8  9  10  11

In [15]:
df1.index.map(str.lower)

Index(['uyo', 'aba', 'itu'], dtype='object')

In [18]:
df1.index= df1.index.map(str.lower)
df1

     A  B   C   D
uyo  0  1   2   3
aba  4  5   6   7
itu  8  9  10  11

In [22]:
df2=df1.rename(index={'uyo':'Uyo'},columns={'A':'Ab'})
df2

     Ab  B   C   D
Uyo   0  1   2   3
aba   4  5   6   7
itu   8  9  10  11

In [23]:
df2.rename(index=str.upper,columns=str.lower)

     ab  b   c   d
UYO   0  1   2   3
ABA   4  5   6   7
ITU   8  9  10  11

In [24]:
df1

     A  B   C   D
uyo  0  1   2   3
aba  4  5   6   7
itu  8  9  10  11

In [26]:
df1.rename(index=str.title,inplace=True)

In [27]:
df1

     A  B   C   D
Uyo  0  1   2   3
Aba  4  5   6   7
Itu  8  9  10  11